trade_exp/src/DocumentJournals/ЧекиККМ/ЧекиККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DocumentJournal xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЧекиККМ</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registeredDocuments>Checked</registeredDocuments>
  </extension>
  <registeredDocuments>Document.ЧекККМ</registeredDocuments>
  <columns>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </columns>
  <columns>
    <name>КассаККМ</name>
    <objectBelonging>Adopted</objectBelonging>
  </columns>
  <columns>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </columns>
  <columns>
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </columns>
  <columns>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </columns>
  <columns>
    <name>Архивный</name>
    <objectBelonging>Adopted</objectBelonging>
  </columns>
  <columns>
    <name>КассоваяСмена</name>
    <objectBelonging>Adopted</objectBelonging>
  </columns>
  <columns extendedConfigurationObject="0aab9ee7-5a86-4085-abdb-eaddc960ce64">
    <name>НомерЧекаККМ</name>
    <objectBelonging>Adopted</objectBelonging>
  </columns>
</mdclass:DocumentJournal>

trade_exp/src/InformationRegisters/ФискальныеОперации/ФискальныеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="3c1c25ab-8458-4f2b-8485-6471eb235795">
  <name>ФискальныеОперации</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="e21067d4-d826-4375-acba-7c91efebe502">
    <name>НомерЧекаККМ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>8</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="6ffef034-2cf3-4222-a352-89b4651cc518">
    <name>ЗаводскойНомерФН</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="a3caeb0f-e2f9-4f6b-acc0-f3ea296568ee">
    <name>Дата</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="22e8c38f-f3e2-42f4-9d67-6271cfd319b2">
    <name>ТипРасчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="1c1cc187-8275-4180-a5c6-7f9a0f455259">
    <name>ТипДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="d8c7ed5d-426c-4a9a-a68a-d51bdff35784">
    <name>Сумма</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="02df977e-c46a-4795-be55-0bdd43dbbc0e">
    <name>ДокументРодитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="08024dfb-e166-4d0d-a97d-da967d88f819">
    <name>ФискальныйПризнак</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="84cc7c8d-7e84-4a02-97dd-d7aa83817ebc">
    <name>НомерСменыККМ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="ad03ef28-0be0-4f8a-8912-dc9050b23247">
    <name>ДополнительныйРеквизит</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="a3459d86-ce94-4244-9541-e8c0ebaf1d8c">
    <name>ИдентификаторЗаписи</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="85c311f9-eaa5-4f91-8d8d-7385bfb79031">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Enums/СтатусыЧековККМ/СтатусыЧековККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтатусыЧековККМ</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Пробит</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="994ecf6c-34a9-4274-952e-8a44959ddd3d">
    <name>КОплате</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="238e807a-b6d8-401c-b115-0e10b84a16c1">
    <name>ОтложенБезРезервирования</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b8d448b2-f4c4-4fef-bd83-69bf834a37d5">
    <name>ОтложенСРезервированием</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/СтатусыКассовойСмены/СтатусыКассовойСмены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтатусыКассовойСмены</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Открыта</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Documents/ЧекККМВозврат/ЧекККМВозврат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЧекККМВозврат</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.ДвижениеМаркированногоТовара</registerRecords>
  <attributes>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЧекККМ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПричинаДляОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПричинаДляОрганизацииСпр</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Покупатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КартаЛояльности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаБонусныхБалловКВозврату</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КассоваяСмена</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КассаККМ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГлавныйБухгалтер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Кассир</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d6efd4c0-aadb-4fbc-bab2-5bb6f02a424f">
    <name>СторноОрдер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="017fb748-2a94-46b5-a01d-8eaba05eaa20">
    <name>ИсключитьИзКонтроля</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="60dd2802-f9c1-435e-923c-d459e0c47112">
    <name>ДатаПоследнегоОткрытия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a8c72a24-a385-45d4-9b74-f0036e4d090c">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e2838228-73ec-4d7e-9180-86f69e84dd8e">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d5501ee7-ab3c-46cd-b2a5-2895d1a748a2">
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="37bb3306-a9d4-4d76-ab58-8b95bdb8edf4">
    <name>ПодразделениеМенеджера</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="55fa59b5-6609-46c8-8c2e-e86b95d64bed">
    <name>ОтделМенеджера</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ХарактеристикаНабора</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НоменклатураЕГАИС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НоменклатураНабора</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Штрихкод</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>200</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Продавец</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Помещение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="285439ea-2699-4a2a-b693-b5ca7dcf27c1">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОплатаПлатежнымиКартами</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ЭквайринговыйТерминал</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ОплатаОтменена</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КодАвторизации</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>6</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СсылочныйНомер</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НомерПлатежнойКарты</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>22</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НомерЧекаЭТ</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>10</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>БонусныеБаллы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ДатаНачисления</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ДатаСписания</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СуммаБонусныхБаллов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>БонуснаяПрограммаЛояльности</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Catalogs/КассыККМ/КассыККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>КассыККМ</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <owners>Checked</owners>
  </extension>
  <owners>Catalog.Организации</owners>
  <attributes>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

trade_exp/src/DocumentJournals/ЧекиККМ/Forms/ФормаСписка/Module.bsl
#Область Розница_опт
&НаСервере
Функция ЯвляетсяКассиром()
	
	возврат рольдоступна("Полныеправа") или рольдоступна("ОтметкаКассы");
	
КонецФункции // ПроверитьПравоНаОтметкуКассы()
&НаКлиенте
Процедура Док_ПриОткрытииПосле(Отказ)
	если ЯвляетсяКассиром() тогда
		КассаККМ = КассаККМТекущегоПользователя();
		КассаККМОтборПриИзменении(Неопределено);
		возврат;
	конецесли;
	Элементы.ГруппаКасса.Видимость=ложь;
	Элементы.ЧекиККМСоздатьЧекККМ.Доступность=Истина;
	Элементы.ГруппаСостояниеКассовойСмены.Видимость=Ложь;
	Элементы._ГруппаМенеджер.Видимость=истина;
	КассаККМ="";
	если значениезаполнено(Склад) тогда
		КассаККМ=КассаККМПоумолчанию();
	конецесли;
	Элементы.ЧекиККМСоздатьЧекККМНаВозврат.Видимость=Ложь;
	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(ЧекиККМ, "КассаККМ");
	
КонецПроцедуры
&НаСервере
Функция КассаККМПоумолчанию()
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КассыККМ.Ссылка КАК кассаККМ
	|ИЗ
	|	Справочник.КассыККМ КАК КассыККМ
	|ГДЕ
	|	НЕ КассыККМ.ПометкаУдаления
	|	И КассыККМ.Подразделение = &Подразделение
	|	И КассыККМ.Владелец = КассыККМ.Подразделение.Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	КассыККМ.Ссылка
	|ИЗ
	|	Справочник.КассыККМ КАК КассыККМ
	|ГДЕ
	|	НЕ КассыККМ.ПометкаУдаления
	|	И КассыККМ.Подразделение = &Подразделение";
	
	Запрос.УстановитьПараметр("Склад",Склад);
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("Дата",ТекущаяДата());
	Запрос.УстановитьПараметр("Подразделение",_Подразделение);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	если ВыборкаДетальныеЗаписи.Следующий() тогда
		
		возврат ВыборкаДетальныеЗаписи.кассаККМ;
	иначе
		//возврат Справочники.КассыККМ.КассаККМФискальныйРегистраторДляРМК();
		возврат Справочники.КассыККМ.ПустаяСсылка();
	конецесли;
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
КонецФункции // КассаККМПоумолчанию()()
&НаКлиенте
Процедура Док_СоздатьЧекККМВместо(Команда)
	
	Если КассаРаботаетЧерезАтолСервер(Строка(КассаККМ)) Тогда
		Сообщить(СтрШаблон("%1 не используется в рабочем месте кассира", КассаККМ));
		Возврат;
	КонецЕсли;
	
	если не значениезаполнено(КассаККМ) тогда
		ТекстСообщения = НСтр("ru = 'Касса ККМ не выбрана! Возможно не открыта кассовая смена.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		возврат;
	конецесли; 
	ИмяОткрываемойФормы = "Документ.ЧекККМ.Форма.ФормаДокументаРМК";
	
	ПараметрыОткрытияФормы = Новый Структура("Основание", Новый Структура("КассаККМ", КассаККМ));
	ПараметрыОткрытияФормы.Вставить("Склад",Склад);
	ОткрытьФорму(ИмяОткрываемойФормы, ПараметрыОткрытияФормы);
КонецПроцедуры

Функция КассаРаботаетЧерезАтолСервер(НаименованиеКассы)
	
	Возврат 	
		СтрНайти(НаименованиеКассы, 	"КСО") > 0
		Или СтрНайти(НаименованиеКассы, "МЕНЕДЖЕРОВ") > 0
		Или СтрНайти(НаименованиеКассы, "Сайт") > 0;
	
КонецФункции

&НаКлиенте
Процедура Док_СкладПриИзмененииПосле(Элемент)
	КассаККМ=КассаККМПоумолчанию();
	УстановитьОтборДинамическихСписковНаСервере();
	//НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Подразделение", "_Подразделение");
	//НовыйМассив = Новый Массив();
	//НовыйМассив.Добавить(НоваяСвязь);
	//НовыеСвязи = Новый ФиксированныйМассив(НовыйМассив);
	//Элементы.Склад.СвязиПараметровВыбора = НовыеСвязи;
	
	
	
	
КонецПроцедуры
&НаСервере
Функция НайтиСменупоСкладу(Склад)
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КассыККМ.Ссылка
	|ИЗ
	|	Справочник.КассыККМ КАК КассыККМ
	|ГДЕ
	|	КассыККМ.Склад = &Склад";
	
	Запрос.УстановитьПараметр("Склад",Склад);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	если ВыборкаДетальныеЗаписи.Следующий() тогда
		возврат ВыборкаДетальныеЗаписи.ссылка;
	иначе
		возврат Справочники.КассыККМ.КассаККМФискальныйРегистраторДляРМК();
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
	КонецЕсли;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	
	
КонецФункции // НайтиСменупоСкладу()
&НаКлиенте
Процедура Док_ОтложенныеЧекиВыборПосле(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.ОтложенныеЧеки.ТекущиеДанные;
	ТекущиеДанныеСтатус = ТекущиеДанные.Статус;

	ИмяОткрываемойФормы = ИмяОткрываемойФормы(ТекущиеДанные.Ссылка,ТекущиеДанныеСтатус);
	
	ПараметрыОткрытия = Новый Структура("Ключ", ТекущиеДанные.Ссылка);
	
	Если ЧекнеПробит(ТекущиеДанные.Ссылка) Тогда
		СтандартнаяОбработка = Ложь;
		
		если ЯвляетсяКассиром() тогда
			если не значениезаполнено(КассаККМ) тогда
				ТекстСообщения = НСтр("ru = 'Касса ККМ не выбрана! Возможно не открыта кассовая смена.'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				возврат;
			конецесли;
			ПараметрыОткрытия.Вставить("Основание",Новый структура("КассаККМ",КассаККМ));
		конецесли;	
		
		ОткрытьФорму(ИмяОткрываемойФормы, ПараметрыОткрытия);
	КонецЕсли;
	
КонецПроцедуры
&Насервере
Функция ЧекНеПробит(Документ)
	
	возврат Документ.Статус<>ПредопределенноеЗначение("Перечисление.СтатусыЧековККМ.Пробит");
	
КонецФункции // ЧекПробит()


&НаКлиенте
Процедура Док_КассаККМ_МенеджерНачалоВыбораПосле(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Реквизит", Элемент.Имя);
	ОткрытьФорму("ЖурналДокументов.ЧекиККМ.Форма.ОткрытыеКассыККМ", СтруктураПараметров, Элемент);
	
КонецПроцедуры


&НаКлиенте
Процедура Док__ОбновитьПосле(Команда)
	КассаККМ=КассаККМПоумолчанию();
	УстановитьОтборДинамическихСписковНаСервере();
	
КонецПроцедуры


&НаКлиенте
Процедура Док_ЧекиККМВыборВместо(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.ЧекиККМ.ТекущиеДанные;  
	ТекущиеДанныеСтатус = ТекущиеДанные.Статус;
	ИмяОткрываемойФормы = ИмяОткрываемойФормы(ТекущиеДанные.Ссылка,ТекущиеДанныеСтатус);
	
	ПараметрыОткрытия = Новый Структура("Ключ", ТекущиеДанные.Ссылка);
	Если ЧекНеПробит(ТекущиеДанные.Ссылка) Тогда
		СтандартнаяОбработка = Ложь;
		если ЯвляетсяКассиром() тогда
			ПараметрыОткрытия.Вставить("Основание",Новый структура("КассаККМ",КассаККМ));
		конецесли;	
		ОткрытьФорму(ИмяОткрываемойФормы, ПараметрыОткрытия);
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура Док_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)   
	
	//УправлениеПечатью.ПриСозданииНаСервере(ЭтаФорма, Элементы._ПодменюПечатьОтложенные);
	//ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	//ПараметрыРазмещения.КоманднаяПанель = Элементы._ПодменюПечатьОтложенные;  
	//ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтаФорма, ПараметрыРазмещения);    Задвоение команд при вызове здесь
	
	//ДатаС= НачалоМесяца(ДобавитьМесяц(ТекущаяДата(), -2));
	//ДатаС=НачалоДня(ТекущаяДата());
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЧекиККМ,"ДатаНачала",НачалоДня(ТекущаяДата()),истина);
	
	//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЧекиККМ, "Дата", ДатаС, ВидСравненияКомпоновкиДанных.БольшеИлиРавно);
	_Подразделение=Пользователи.ТекущийПользователь().Подразделение;
	//Светлакова
	ЭтаФорма.Элементы.ПробитьИТ.Видимость=РольДоступна("ПолныеПрава");
	ЭтаФорма.Элементы.ПробитьИТ.Доступность=РольДоступна("ПолныеПрава");
	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Док_ЧекиККМВыборПосле(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.ЧекиККМ.ТекущиеДанные;  
	ТекущиеДанныеСтатус = ТекущиеДанные.Статус;
	Если ТипЗнч(ТекущиеДанные.Ссылка) = Тип("ДокументСсылка.ЧекККМ") Тогда
		
		ИмяОткрываемойФормы = ИмяОткрываемойФормы(ТекущиеДанные.Ссылка,ТекущиеДанныеСтатус);
		
		ПараметрыОткрытия = Новый Структура("Ключ", ТекущиеДанные.Ссылка);
		
		если ЯвляетсяКассиром() тогда
			если не значениезаполнено(КассаККМ) тогда
				ТекстСообщения = НСтр("ru = 'Касса ККМ не выбрана! Возможно не открыта кассовая смена.'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				возврат;
			конецесли;
			ПараметрыОткрытия.Вставить("Основание",Новый структура("КассаККМ",КассаККМ));
		конецесли;
		Если ЧекНеПробит(ТекущиеДанные.Ссылка) Тогда
			СтандартнаяОбработка = Ложь;
			ОткрытьФорму(ИмяОткрываемойФормы, ПараметрыОткрытия);
		КонецЕсли;
	конецесли;
	
КонецПроцедуры


&НаСервере
Функция ВозвратитьСтатус(ссылка)
	
	возврат ссылка.статус;
	
КонецФункции // ВозвратитьСтатус()

&НаКлиенте
Функция ДОК_СсылкаНаЭлементСпискаПоШтрихкоду(Штрихкод)
	Менеджеры = Новый Массив();
	Менеджеры.Добавить(ПредопределенноеЗначение("Документ.РеализацияТоваровУслуг.ПустаяСсылка")); // ищем для быстроты только реализации
	Менеджеры.Добавить(ПредопределенноеЗначение("Документ.ЧекККМ.ПустаяСсылка")); // ищем для быстроты только реализации
	
	Возврат ШтрихкодированиеПечатныхФормКлиент.ПолучитьСсылкуПоШтрихкодуТабличногоДокумента(Штрихкод, Менеджеры);
КонецФункции

&НаКлиенте
Процедура Док_ЧекиККМПередНачаломДобавленияВместо(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	ТекущиеДанные = Элементы.ЧекиККМ.ТекущиеДанные; 
	ТекущиеДанныеСтатус = ТекущиеДанные.Статус;
	Отказ = Истина;
	
	Если Не (ЗначениеЗаполнено(КассаККМ) И ДоступноДобавлениеИзменениеЧековККМ) Тогда
		Возврат;
	КонецЕсли;
	
	Если Копирование = Истина Тогда
		
		ИмяОткрываемойФормы = ИмяОткрываемойФормы(ТекущиеДанные.Ссылка, ТекущиеДанныеСтатус);
		ПараметрыОткрытияФормы = Новый Структура("Основание", ТекущиеДанные.Ссылка);
		если не ЯвляетсяКассиром() тогда
			ПараметрыОткрытияФормы.Вставить("Склад",Склад);
		конецесли;
		
		ОткрытьФорму(
		"Документ.ЧекККМ.Форма.ФормаДокументаРМК",
		ПараметрыОткрытияФормы);
		
	Иначе
		
		ПараметрыОткрытияФормы = Новый Структура("Основание", Новый Структура("КассаККМ", КассаККМ));
		если не ЯвляетсяКассиром() тогда
			ПараметрыОткрытияФормы.Вставить("Склад",Склад);
		конецесли;
		
		ОткрытьФорму(
		"Документ.ЧекККМ.Форма.ФормаДокументаРМК",
		ПараметрыОткрытияФормы);
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Док_СоздатьЧекККМНаВозвратВместо(Команда)
	
	ИмяОткрываемойФормы = "Документ.ЧекККМВозврат.Форма.ФормаДокументаРМК";
	
	ПараметрыОткрытияФормы = Новый Структура("Основание", Новый Структура("КассаККМ", КассаККМ));
	ОткрытьФорму(ИмяОткрываемойФормы, ПараметрыОткрытияФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура Док_ЧекиККМПриАктивизацииСтрокиПосле(Элемент)
	если ЯвляетсяКассиром() тогда
		возврат;
	конецесли;
	УстановитьДоступностьКомандСозданияДокументовНаВозврат_Менеджер();	
	
КонецПроцедуры
&НаСервере
Функция ВозвратитьСменаОткрыта(КассоваяСмена)
	
	возврат КассоваяСмена.статус=перечисления.СтатусыКассовойСмены.Открыта;
	
КонецФункции // ВозвратитьСменаОткрыта()

&НаКлиенте
Процедура УстановитьДоступностьКомандСозданияДокументовНаВозврат_Менеджер()
	
	//Если СтруктураСостояниеКассовойСмены = Неопределено И ЗначениеЗаполнено(КассаККМ) Тогда
	//	ОбновитьСостояниеКассовойСменыИУстановитьОтборДинамическихСписковНаКлиенте(КассаККМ);
	//КонецЕсли;
	
	ТекущиеДанные = Элементы.ЧекиККМ.ТекущиеДанные;
	КС_Открыта=ложь;
	Если ТекущиеДанные <> Неопределено
		И СтруктураСостояниеКассовойСмены <> Неопределено
		И ТекущиеДанные.Свойство("Тип") И (ТекущиеДанные.Тип = Тип("ДокументСсылка.ЧекККМ") Или ТекущиеДанные.Тип = Тип("ДокументСсылка.РеализацияПодарочныхСертификатов")) Тогда
		
		ЧекПробит = ЗначениеЗаполнено(ТекущиеДанные.НомерЧекаККМ);
		КС_Открыта=возвратитьСменаОткрыта(ТекущиеДанные.кассоваясмена);
		
		Если ТекущиеДанные.Тип = Тип("ДокументСсылка.ЧекККМ") Тогда
			
			Если ЧекПробит  тогда
				
				ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЧекиККМДокументЧекККМВозвратСоздатьНаОсновании",                   "Доступность", КС_Открыта);
				ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЧекиККМДокументВозвратПодарочныхСертификатовСоздатьНаОсновании",   "Доступность", Ложь);
				ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЧекиККМДокументВозвратТоваровОтКлиентаСоздатьНаОсновании",         "Доступность", истина);
				ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЧекиККМДокументЗаявкаНаВозвратТоваровОтКлиентаСоздатьНаОсновании", "Доступность", Ложь);
				ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КонтекстноеМенюЧекиККМДокументЧекККМВозвратСоздатьНаОсновании",                   "Доступность", КС_Открыта);
				ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КонтекстноеМенюЧекиККМДокументВозвратПодарочныхСертификатовСоздатьНаОсновании",   "Доступность", Ложь);
				ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КонтекстноеМенюЧекиККМДокументВозвратТоваровОтКлиентаСоздатьНаОсновании",         "Доступность", истина);
				ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КонтекстноеМенюЧекиККМДокументЗаявкаНаВозвратТоваровОтКлиентаСоздатьНаОсновании", "Доступность", Ложь);
				//		ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЧекиККМСоздатьЧекККМНаВозврат", "Доступность", КС_Открыта);
			Иначе
				
				ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЧекиККМДокументЧекККМВозвратСоздатьНаОсновании",                   "Доступность", Ложь);
				ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЧекиККМДокументВозвратПодарочныхСертификатовСоздатьНаОсновании",   "Доступность", Ложь);
				ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЧекиККМДокументВозвратТоваровОтКлиентаСоздатьНаОсновании",         "Доступность", Ложь);
				ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЧекиККМДокументЗаявкаНаВозвратТоваровОтКлиентаСоздатьНаОсновании", "Доступность", Ложь);
				ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КонтекстноеМенюЧекиККМДокументЧекККМВозвратСоздатьНаОсновании",                   "Доступность", Ложь );
				ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КонтекстноеМенюЧекиККМДокументВозвратПодарочныхСертификатовСоздатьНаОсновании",   "Доступность", Ложь);
				ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КонтекстноеМенюЧекиККМДокументВозвратТоваровОтКлиентаСоздатьНаОсновании",         "Доступность", Ложь);
				ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КонтекстноеМенюЧекиККМДокументЗаявкаНаВозвратТоваровОтКлиентаСоздатьНаОсновании", "Доступность", Ложь);
				//		ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЧекиККМСоздатьЧекККМНаВозврат", "Доступность", Ложь);
			КонецЕсли;
			
		ИначеЕсли ТекущиеДанные.Тип = Тип("ДокументСсылка.РеализацияПодарочныхСертификатов") Тогда
			
			ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЧекиККМДокументЧекККМВозвратСоздатьНаОсновании",                   "Доступность", Ложь);
			ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЧекиККМДокументВозвратПодарочныхСертификатовСоздатьНаОсновании",   "Доступность", Ложь);
			ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЧекиККМДокументВозвратТоваровОтКлиентаСоздатьНаОсновании",         "Доступность", Ложь);
			ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЧекиККМДокументЗаявкаНаВозвратТоваровОтКлиентаСоздатьНаОсновании", "Доступность", Ложь);
			ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КонтекстноеМенюЧекиККМДокументЧекККМВозвратСоздатьНаОсновании",                   "Доступность", Ложь);
			ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КонтекстноеМенюЧекиККМДокументВозвратПодарочныхСертификатовСоздатьНаОсновании",   "Доступность", Ложь);
			ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КонтекстноеМенюЧекиККМДокументВозвратТоваровОтКлиентаСоздатьНаОсновании",         "Доступность", Ложь);
			ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КонтекстноеМенюЧекиККМДокументЗаявкаНаВозвратТоваровОтКлиентаСоздатьНаОсновании", "Доступность", Ложь);
			
			
		КонецЕсли;
		
	Иначе
		
		ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЧекиККМДокументЧекККМВозвратСоздатьНаОсновании",                          "Доступность", Ложь);
		ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЧекиККМДокументВозвратПодарочныхСертификатовСоздатьНаОсновании",          "Доступность", Ложь);
		ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЧекиККМДокументВозвратТоваровОтКлиентаСоздатьНаОсновании",                "Доступность", Ложь);
		ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЧекиККМДокументЗаявкаНаВозвратТоваровОтКлиентаСоздатьНаОсновании",        "Доступность", Ложь);
		ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КонтекстноеМенюЧекиККМДокументЧекККМВозвратСоздатьНаОсновании",                   "Доступность", Ложь);
		ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КонтекстноеМенюЧекиККМДокументВозвратПодарочныхСертификатовСоздатьНаОсновании",   "Доступность", Ложь);
		ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КонтекстноеМенюЧекиККМДокументВозвратТоваровОтКлиентаСоздатьНаОсновании",         "Доступность", Ложь);
		ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КонтекстноеМенюЧекиККМДокументЗаявкаНаВозвратТоваровОтКлиентаСоздатьНаОсновании", "Доступность", Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Док_ОрганизацияПриИзмененииПосле(Элемент)
	КассаККМ=КассаККМПоумолчанию();
	УстановитьОтборДинамическихСписковНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура Док_ЧекиККМПередНачаломИзмененияВместо(Элемент, Отказ)
	ТекущиеДанные = Элементы.ЧекиККМ.ТекущиеДанные;
	ТекущиеДанныеСтатус = ТекущиеДанные.Статус;
	ИмяОткрываемойФормы = ИмяОткрываемойФормы(ТекущиеДанные.Ссылка,ТекущиеДанныеСтатус);
	
	ПараметрыОткрытия = Новый Структура("Ключ", ТекущиеДанные.Ссылка);
	Если ЧекНеПробит(ТекущиеДанные.Ссылка) Тогда
		Отказ = Истина;
		ОткрытьФорму(ИмяОткрываемойФормы, ПараметрыОткрытия);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ПрименитьСтатус(Команда)
	УстановитьСтатусПробит(Элементы.ЧекиККМ.ТекущиеДанные.Ссылка);
КонецПроцедуры

&НаСервере
Функция УстановитьСтатусПробит(Док)
	ДокОбъект = Док.ПолучитьОбъект();	
	ДокОбъект.Статус = Перечисления.СтатусыЧековККМ.Пробит;
	ДокОбъект.Записать();
КонецФункции	


&Вместо("ОбработатьШтрихкоды")
&НаКлиенте
Процедура Док_ОбработатьШтрихкоды(Данные)
	МассивСсылок = СсылкаНаЭлементСпискаПоШтрихкоду(Данные.Штрихкод);
	Если МассивСсылок.Количество() > 0 Тогда
		
		Ссылка = МассивСсылок[0];
		//+ Альтерра изменения
		Элементы.ЧекиККМ.ТекущаяСтрока = Ссылка;
		Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЧекККМ") Тогда
			
			ИмяОткрываемойФормы = ИмяОткрываемойФормы(Ссылка,СтатусДокумента(Ссылка));
			
			ПараметрыОткрытия = Новый Структура("Ключ", Ссылка);
			если ЯвляетсяКассиром() тогда
				если не значениезаполнено(КассаККМ) тогда
					ТекстСообщения = НСтр("ru = 'Касса ККМ не выбрана! Возможно не открыта кассовая смена.'");
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
					возврат;
				конецесли;
				
				ПараметрыОткрытия.Вставить("Основание",Новый структура("КассаККМ",КассаККМ));
				
				Если ВозвратитьСтатус(ссылка) <> ПредопределенноеЗначение("Перечисление.СтатусыЧековККМ.Пробит") Тогда
					СтандартнаяОбработка = Ложь;
					ОткрытьФорму(ИмяОткрываемойФормы, ПараметрыОткрытия);
				Иначе 
					ОткрытьЗначение(Ссылка);
				КонецЕсли;
			Иначе 
				ОткрытьЗначение(Ссылка);
			КонецЕсли;
		иначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЧекККМВозврат") Тогда
			ИмяОткрываемойФормы = ИмяОткрываемойФормы(Ссылка,СтатусДокумента(Ссылка));
			ПараметрыОткрытия = Новый Структура("Ключ", Ссылка);
			Если ВозвратитьСтатус(ссылка) <> ПредопределенноеЗначение("Перечисление.СтатусыЧековККМ.Пробит") Тогда
				СтандартнаяОбработка = Ложь;
				ОткрытьФорму(ИмяОткрываемойФормы, ПараметрыОткрытия);
			Иначе 
				ОткрытьЗначение(Ссылка);
			КонецЕсли;
		иначе
			ОткрытьЗначение(Ссылка);
		конецесли;	
		//-
	Иначе
		ШтрихкодированиеПечатныхФормКлиент.ОбъектНеНайден(Данные.Штрихкод);
	КонецЕсли;
КонецПроцедуры

#Область ПоискПоQR

&НаСервере
Функция ПолучитьДокументПродажи(ДокументОплаты)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.ОснованиеПлатежа КАК ОснованиеПлатежа
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК ПриходныйКассовыйОрдерРасшифровкаПлатежа
	|ГДЕ
	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ДокументОплаты);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.ОснованиеПлатежа;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции // ПолучитьДокументПродажи()

&НаКлиенте
Процедура Док_ОбработкаОповещенияПеред(ИмяСобытия, Параметр, Источник)
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" Тогда
			Если Параметр.Количество() > 0 И ТипЗнч(Параметр[0])=Тип("Строка") Тогда
				СтрокаКода = Параметр[0];
				Если СтрНайти(НРег(СтрокаКода), "fn") <> 0 Тогда
					СФП_МаркерыКлиент.МаркерНачало("Журнал Чеки ККМ сканирование");
					
					ОчиститьСообщения();
					ВсеДокументы = Элементы.Группа1.ТекущаяСтраница.Заголовок<>"Основная";
					//СписокПоиска = ?(ВсеДокументы, ЧекиККМ, ЧекиККМ);
					СсылкаНаДокумент = АльтерраОбщегоНазначения.ПолучитьСсылкуНаДокументПоQR(СтрокаКода);
					Если ВсеДокументы=Истина И ТипЗнч(СсылкаНаДокумент)<>Тип("ДокументСсылка.ЧекККМ") Тогда
						ДокументПродажи = ПолучитьДокументПродажи(СсылкаНаДокумент);
						СсылкаНаДокумент = ДокументПродажи; 
					КонецЕсли;
					
					Если СсылкаНаДокумент<>Неопределено Тогда
						_ДокументПродажи = СсылкаНаДокумент;
						Если ВсеДокументы Тогда
							Элементы._ОчиститьПоискПоДокументу1.Видимость = Истина;
						Иначе
							Элементы._ОчиститьПоискПоДокументу.Видимость = Истина;
						КонецЕсли;
						
						_ОтборДокумент.Добавить(_ДокументПродажи);
						
						ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЧекиККМ,
						"Ссылка",
						_ОтборДокумент,
						ВидСравненияКомпоновкиДанных.Равно,
						,
						ЗначениеЗаполнено(_ОтборДокумент));
						МенеджерОборудованияУТКлиент.ОбработатьСобытие();
					Иначе
						ОчиститьПоискQR();
						//Сообщить("Документ " + Строка(СсылкаНаДокумент) + " не найден");
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Док__ОтменитьПоискПоQRПосле(Команда)
	ОчиститьПоискQR();
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПоискQR()
	Элементы._ОчиститьПоискПоДокументу.Видимость = Ложь;
	Элементы._ОчиститьПоискПоДокументу1.Видимость = Ложь;
	_ОтборДокумент.Очистить();
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЧекиККМ,
	"Ссылка",
	_ОтборДокумент,
	ВидСравненияКомпоновкиДанных.ВСписке,
	,
	ЗначениеЗаполнено(_ОтборДокумент));
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЧекиККМ,
	"Ссылка",
	_ОтборДокумент,
	ВидСравненияКомпоновкиДанных.ВСписке,
	,
	ЗначениеЗаполнено(_ОтборДокумент));
	
КонецПроцедуры // ОчиститьПоискQR()

#КонецОбласти

Функция КассаККМТекущегоПользователя()
	
	Возврат РозничныеПродажи.ПолучитьКассуККМТекущегоПользователя();
	
КонецФункции

&НаСервереБезКонтекста
&ИзменениеИКонтроль("ЧекиККМПриПолученииДанныхНаСервере")
Процедура Док_ЧекиККМПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	Ключи = Строки.ПолучитьКлючи();
	
	Запрос = Новый Запрос;
	#Удаление
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ЧекККМВозврат.ЧекККМ КАК Ссылка,
	|	ЧекККМВозврат.Ссылка КАК ОтложенныйЧекККМВозврат
	|ИЗ
	|	Документ.ЧекККМВозврат КАК ЧекККМВозврат
	|ГДЕ
	|	ЧекККМВозврат.ЧекККМ В (&Ссылка)
	|	И ЧекККМВозврат.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробит)
	|";
	#КонецУдаления
	#Вставка
	Запрос.Текст = "ВЫБРАТЬ
	|	ФискальныеОперации.ДокументОснование КАК Ссылка,
	|	МАКСИМУМ(ФискальныеОперации.НомерЧекаККМ) КАК НомерЧекаККМ
	|ИЗ
	|	РегистрСведений.ФискальныеОперации КАК ФискальныеОперации
	|ГДЕ
	|	ФискальныеОперации.ДокументОснование В (&Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ФискальныеОперации.ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЧекККМВозврат.ЧекККМ КАК Ссылка,
	|	ЧекККМВозврат.Ссылка КАК ОтложенныйЧекККМВозврат
	|ИЗ
	|	Документ.ЧекККМВозврат КАК ЧекККМВозврат
	|ГДЕ
	|	ЧекККМВозврат.ЧекККМ В (&Ссылка)
	|	И ЧекККМВозврат.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.ОтложенБезРезервирования) 
	|";
	#КонецВставки
	
	Запрос.УстановитьПараметр("Ссылка", Ключи);
	#Удаление
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		ВыборкаЧекККМВозврат = РезультатЗапроса.Выбрать();
		
		Для Каждого Строка Из Строки Цикл
			Строка = Строки[Строка.Ключ];
			
			ВыборкаЧекККМВозврат.Сбросить();
			Если ВыборкаЧекККМВозврат.НайтиСледующий(Строка.Данные["Ссылка"], "Ссылка") Тогда 
				Строка.Данные["ОтложенныйЧекККМВозврат"] = ВыборкаЧекККМВозврат.ОтложенныйЧекККМВозврат;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	#КонецУдаления
	#Вставка
	Результаты = Запрос.ВыполнитьПакет();
	
	Если Не (Результаты[0].Пустой() И Результаты[1].Пустой()) Тогда
		
		ВыборкаФискальныеОперации = Результаты[0].Выбрать();
		ВыборкаЧекККМВозврат = Результаты[1].Выбрать();
		
		Для Каждого Строка Из Строки Цикл
			
			Строка = Строки[Строка.Ключ];
			
			Если ВыборкаФискальныеОперации.Количество() Тогда
				ВыборкаФискальныеОперации.Сбросить();
				Если ВыборкаФискальныеОперации.НайтиСледующий(Строка.Данные["Ссылка"], "Ссылка") Тогда
					Строка.Данные["НомерЧекаККМ"] = Строка(ВыборкаФискальныеОперации.НомерЧекаККМ);
				Иначе
					Строка.Данные["НомерЧекаККМ"] = "Не пробит"; 
				КонецЕсли;
			КонецЕсли;
			Если ВыборкаЧекККМВозврат.Количество() Тогда
				ВыборкаЧекККМВозврат.Сбросить();
				Если ВыборкаЧекККМВозврат.НайтиСледующий(Строка.Данные["Ссылка"], "Ссылка") Тогда 
					Строка.Данные["ОтложенныйЧекККМВозврат"] = ВыборкаЧекККМВозврат.ОтложенныйЧекККМВозврат;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	#КонецВставки
	
КонецПроцедуры
